## Staging: translation
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 5 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                   NAME                                   |
|--------|--------------------------------------------------------------------------|
| add    | `aws_iam_access_key.weblate`                                             |
|        | `aws_iam_group.weblate_translation`                                      |
|        | `aws_iam_group_policy_attachment.translate_full_access`                  |
|        | `aws_iam_user.automatic_suggestion_weblate`                              |
|        | `aws_iam_user_group_membership.weblate_translation_automatic_suggestion` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_access_key.weblate will be created
  + resource "aws_iam_access_key" "weblate" {
      + create_date                    = (known after apply)
      + encrypted_secret               = (known after apply)
      + encrypted_ses_smtp_password_v4 = (known after apply)
      + id                             = (known after apply)
      + key_fingerprint                = (known after apply)
      + secret                         = (sensitive value)
      + ses_smtp_password_v4           = (sensitive value)
      + status                         = "Active"
      + user                           = "AutomaticSuggestionWeblate"
    }

  # aws_iam_group.weblate_translation will be created
  + resource "aws_iam_group" "weblate_translation" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "WeblateTranslation"
      + path      = "/"
      + unique_id = (known after apply)
    }

  # aws_iam_group_policy_attachment.translate_full_access will be created
  + resource "aws_iam_group_policy_attachment" "translate_full_access" {
      + group      = "WeblateTranslation"
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/TranslateFullAccess"
    }

  # aws_iam_user.automatic_suggestion_weblate will be created
  + resource "aws_iam_user" "automatic_suggestion_weblate" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "AutomaticSuggestionWeblate"
      + path          = "/"
      + tags_all      = (known after apply)
      + unique_id     = (known after apply)
    }

  # aws_iam_user_group_membership.weblate_translation_automatic_suggestion will be created
  + resource "aws_iam_user_group_membership" "weblate_translation_automatic_suggestion" {
      + groups = [
          + "WeblateTranslation",
        ]
      + id     = (known after apply)
      + user   = "AutomaticSuggestionWeblate"
    }

Plan: 5 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_iam_user.automatic_suggestion_weblate"]

18 tests, 17 passed, 1 warning, 0 failures, 0 exceptions

```

</details>
